Revit 2024 API
BuiltInFailures.AutoRouteFailures.NoValidSolutionAtSelectedPoint Property
 No valid auto-route solution at selected point.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId NoValidSolutionAtSelectedPoint { get; }
Visual Basic
Public Shared ReadOnly Property NoValidSolutionAtSelectedPoint As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ NoValidSolutionAtSelectedPoint {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.AutoRouteFailures Class
Autodesk.Revit.DB Namespace